// Запросить у пользователя год и проверить, високосный он или нет. Високосный год либо кратен 400, либо кратен 4 и при этом не кратен 100.
let year = prompt("Введіть рік");

// Перший розв'язок
// if (+year % 400 == 0 && +year % 100 != 0) {
//   alert("Рік високосний");
// } else if (+year % 4 == 0 && +year % 100 != 0) {
//   alert("Рік високосний");
// } else {
//   alert("Рік не високосний");
// }

// Другий розв'язок
if (
  (+year % 4 == 0 && +year % 100 != 0) ||
  (+year % 400 == 0 && +year % 100 != 0)
) {
  alert("Рік високосний");
} else {
  alert("Рік не високосний");
}
