// Задать пользователю 3 вопроса, в каждом вопросе по 3 варианта ответа.
// За каждый правильный ответ начисляется 2 балла.
// После вопросов выведите пользователю количество набранных баллов.

let q1 = prompt(
  "Скільки всього планет у сонячній системі? Введіть букву: а) 5 б) 6 в) 8"
);
let q2 = prompt(
  "Планета, яка ближче всього розташована до Сонця? Введіть букву: а) Меркурій б) Венера в) Марс"
);
let q3 = prompt(
  "Найгарячіша планета? Введіть букву: а) Меркурій б) Венера в) Марс"
);

if (q1 === "в" && q2 === "а" && q3 === "б") {
  alert("6");
} else if (
  (q1 !== "в" && q2 === "а" && q3 === "б") ||
  (q1 === "в" && q2 !== "а" && q3 === "б") ||
  (q1 === "в" && q2 === "а" && q3 !== "б")
) {
  alert("4");
} else if (
  (q1 !== "в" && q2 !== "а" && q3 === "б") ||
  (q1 === "в" && q2 !== "а" && q3 !== "б") ||
  (q1 !== "в" && q2 === "а" && q3 !== "б")
) {
  alert("2");
} else if (q1 !== "в" && q2 !== "а" && q3 !== "б") {
  alert("0");
}
